        namespace JH.ACU.Doc.原程序
        {
            internal class Fc1Res    //  resistance
            {
                // 初始化，给每个输出端都赋值，保证每个管脚的输出为确定状态
                //Global.bytPA = 0x00;
                //Global.bytPB = 0xFF;     // 11110111
                //Global.bytPC = 0x0F;
                // 设置程控电源值为12V
                // 温度
                // 初始化完成

                // 选Card，选待测ACU，接通K-Line
                // 控制继电器，接通程控电源。ACU上电，检测故障，若为历史故障则清除，实时故障则记录且跳过此ACU。

                // 测电阻
                // 测电压


                // 设置好程控电阻的初始值
                // 控制继电器把程控电阻接入ACU
                // 调节程控电阻值，直到ACU检测出故障。超出性能规范范围若仍没检测到故障，记录并跳过此ACU。
                // 控制继电器把数字万用表接入电路，测量此时程控电阻的值



                //Global.bytPA = 0x5F;   // 01011111 = 0x5F, 发控制数据Data0 - Data7，K215, K217吸合，因为些接线端接的为负极，为0时导通。
                //Global.bytPC = 0x71;    //   01110001 = 0x71,PC7为保留，PC6 - PC4 = 111， A3A2A1A0 = 0001，选中U203 CLK
                //Global.bytPB = 0x09;    //  00001001 = 0x09,PB5高电平复位，所以平时为0，PB3为EnCard,高电平有效，所以为1，A6A5A4 = 001，选中Card2,同时也使U201，74HC154使能端G1，使能
                //Thread.Sleep(10);           // 稍微延迟下，保持一会儿低电平。可能需要调试，得结合74HC154资料看看
                //Global.bytPC = 0x7F;  // 01111111 = 0x7F，此时，74HC154的17管脚（输出的第15位）为低电平，其它输出（所有CLK）都为高电平。因为选中Card的同时，使74HC154，CLK芯片使能，所以这里不能取消74HC154的使能来使其输出高电平，只能从输入端控制。
                // 此时完成上升沿，触发U203,使bytPA的数据输出，K215, K217吸合，74HC273有锁存功能，不来上升沿它保持输出，不去检查输入
                //Global.bytPA = 0xF7;// 11110111 = 0xF7, 发送数据，控制K273吸合
                //Global.bytPC = 0x77;    //   01110111 = 0x77,PC7为保留，PC6 - PC4 = 111， A3A2A1A0 = 0111，选中U209 CLK
                //Thread.Sleep(10);  // 因为Card使能时，U201已经处于使能状态，所以此时U209 CLK已输出低电平
                //Global.bytPC = 0x7F;  // 使所有CLK输出高电平，完成上升沿操作，触发U209,使bytPA的数据输出，K273吸合
                // 此时把程控电阻D1箱接入到FC1+、FC1-，DMM断开，接通K-LINE
                // 控制电阻电阻变化。


                //// Card1 - Card 8, 每个都能接ACU，这里以Card2 为例
                //Global.strEnCard = "00000001";// EnCard = 00000001,仅Card2选中
                //Global.strData = "01011111";   // 发控制数据Data0 - Data7，K215, K217吸合，因为些接线端接的为负极，为0时导通。不清楚高低位是否正确，需要调试
                //Global.strPIOPC = "01000001";    // PC0 - PC3 为A0 - A3,PC4接AREL300，经ULN2803放大后接REL300，同理 PC5接REL301, PC7保留
                //// A4,A5,A6 = 001, 选中Y1,即Card2，A3,A2,A1,A0 = 0001,选中U203 CLK, 使其输出低电平。 
                //Global.strEn154 = "0";     // 发送Enable信号，即图中G1为0，此时74HC154可以正常输出，
                //Thread.Sleep(10);           // 稍微延迟下，可能需要调试，得结合74HC154资料看看
                //Global.strEn154 = "1";     // 取消Enable信号，使74HC154的输出为高电平，完成上升沿的设置，此时才能使K215, K217吸合
                //Global.strPI0PC4 = "0";  // K300吸合，这个是用的2206的61脚，PC4
                //Global.strPI0PC6 = "0";  // K301吸合，这个是用的2206的60脚，PC6
            }
        }
